Repository: dobrocity/stopfires
Catalog: app/lib/l10n/app_*.arb
Languages: ru

source: Hello
ru: Привет

source: Welcome
ru: Добро пожаловать

# signup_init_title
source: Let's stop fires together
ru: Победим пожары вместе

source: Email address
ru: Электронная почта

# signup_init_button
source: Sign up
ru: Зарегистрироваться

# sign_up_already_registered
source: I already have an account
ru: У меня уже есть аккаунт

source: Welcome back
ru: Привет снова

# login_init_title
source: Let's continue fighting fires together.
ru: Продолжим борьбу с пожарами вместе.

# login_init_button
source: Login
ru: Войти

# create_new_account
source: Create a new account
ru: Создать новый аккаунт

# edit_email_address
source: Edit the email address
ru: Изменить электронную почту

# insert_new_email_address
source: Insert the new email address below.
ru: Введите новую электронную почту ниже.

source: Edit email
ru: Изменить электронную почту

source: Back
ru: Назад

# verify_email_address
source: Verify your email address
ru: Подтвердите электронную почту

# verify_email_address_description
source: We have sent you a 6 digit code to {email}. Please enter the code below.
ru: Мы отправили вам 6-значный код на {email}. Пожалуйста, введите код ниже.

source: Submit
ru: Отправить

# passkey_verify_title
source: Login with passkey
ru: Войти с помощью PassKey

source: Resend code
ru: Отправить код повторно

source: Change email
ru: Изменить электронную почту

# profile_page_description
source: Ready to fight fires together?
ru: Готовы к борьбе с пожарами вместе?

# edit_profile
source: Profile
ru: Изменить профиль

source: Passkey list
ru: Список PassKey

source: Sign out
ru: Выйти

source: Full name
ru: Полное имя

source: Email
ru: Электронная почта

source: Save changes
ru: Сохранить изменения

source: Full name has been changed successfully.
ru: Полное имя успешно изменено.

source: Check your passkeys
ru: Проверьте ваши PassKey

source: Passkey has been deleted successfully.
ru: PassKey успешно удален.

source: Passkey has been created successfully.
ru: PassKey успешно создан.

source: Add passkey
ru: Добавить PassKey

source: Set up your passkey
ru: Настройте ваш PassKey

# set_up_your_passkey_description
source: Quick and secure login using Apple Touch ID or Face ID instead of passwords.
ru: Быстрый и безопасный вход с помощью Touch ID или Face ID вместо паролей.

source: Create passkey
ru: Создать PassKey

source: Maybe later
ru: Может позже

source: Delete
ru: Удалить

source: Shared map
ru: Общая карта

# fire_clusters_title
source: Fire clusters - {fires} fires, {clusters} clusters
ru: Кластеры пожаров - {fires} пожаров, {clusters} кластеров

# greeting
source: Hi {name}
ru: Привет {name}

# help_improve_app_location
source: Help improve {appName} by sharing your location. We only collect what we need, and you can pause at any time.
ru: Помогите улучшить {appName}, поделившись своим местоположением. Мы собираем только то, что нам нужно, и вы можете приостановить в любое время.

source: What we collect
ru: Что мы собираем

# gps_coordinates
source: GPS coordinates (latitude & longitude)
ru: GPS координаты (широта и долгота)

source: Timestamp and accuracy
ru: Временная метка и точность

# speed_and_heading
source: Speed and heading (if available)
ru: Скорость и направление (если доступно)

# hashed_region
source: Hashed region (geohash) for nearby features
ru: Хешированный регион (geohash) для ближайших функций

source: How we use it
ru: Как мы используем

# show_current_position
source: Show your current position in the app
ru: Показать ваше текущее положение в приложении

# generate_trip_history
source: Generate trip history (time series)
ru: Создать историю поездок (временной ряд)

# enable_background_updates
source: Enable optional background updates (if you opt in)
ru: Включить опциональные фоновые обновления (если вы согласны)

source: Your choices
ru: Ваш выбор

source: Enable location tracking
ru: Включить отслеживание местоположения

# can_pause_later
source: You can pause or disable later in Settings
ru: Вы можете приостановить или отключить позже в Настройках

source: Allow background updates
ru: Разрешить фоновые обновления

# required_android_foreground
source: Required for background service
ru: Требуется для работы приложения в фоновом режиме

source: Use approximate location
ru: Использовать приблизительное местоположение

# lower_precision_privacy
source: Lower precision to improve privacy and battery
ru: Меньшая точность для улучшения конфиденциальности и батареи

source: Data retention
ru: Хранение данных

# trip_history_storage
source: How long your trip history is stored
ru: Как долго хранится история ваших поездок

# days_7
source: 7 days
ru: 7 дней

# days_14
source: 14 days
ru: 14 дней

# days_30
source: 30 days
ru: 30 дней

# days_90
source: 90 days
ru: 90 дней

source: Privacy
ru: Конфиденциальность

source: Privacy Policy
ru: Политика конфиденциальности

source: Terms of Service
ru: Условия использования

# i_agree_to_above
source: I have read and agree to the Privacy Policy.
ru: Я прочитал и согласен с вышеизложенным.

# can_change_settings
source: You can change these settings at any time.
ru: Вы можете изменить эти настройки в любое время.

source: Decline
ru: Отклонить

# accept_continue
source: Accept
ru: Принять

source: Could not open link
ru: Не удалось открыть ссылку

# location_consent_title
source: Location Permission
ru: Разрешение на местоположение

# location_sharing_disclaimer
source: Location Sharing Notice
ru: Уведомление о совместном использовании местоположения

# location_sharing_disclaimer_text
source: Important: All users can see the recent locations of other online users on the shared map. Your location will be visible to help coordinate firefighting efforts and improve community safety.
ru: Важно: Все пользователи могут видеть недавние местоположения других пользователей онлайн на общей карте. Ваше местоположение будет видимым для координации усилий по тушению пожаров и улучшения безопасности сообщества.

# location_sharing_disclaimer_acknowledge
source: I understand that my location will be visible to other users
ru: Я понимаю, что мое местоположение будет видимым для других пользователей

# location_sharing_disclaimer_privacy
source: Your exact location is only shared while you're actively using the app. You can disable location sharing at any time in settings.
ru: Ваше точное местоположение передается только во время активного использования приложения. Вы можете отключить передачу местоположения в любое время в настройках.
